COMMAND_START = '''
Привіт {username}👋
Я бот, який стежить за новими оголошеннями за твоїм посиланням пошуку.

Щойно на OLX з’явиться новий лот — я миттєво надішлю його тобі ⚡

Що я вмію:
• відстежувати будь-яке посилання пошуку
• повідомляти тільки про нові оголошення
• працювати 24/7 без затримок

Надішли мені посилання на пошук — і я почну стеження 🔍
'''

ADS_RESPONSE_TEXT = '''
🆕 <b>Нове оголошення</b>

<b>{title}</b>

💰 <b>Ціна:</b> {price}
📍 <b>Локація:</b> {location_and_date}

🔗 <a href="{advert_url}">Відкрити оголошення</a>

'''

SEARCHES_LIMIT = '''
⛔️ <b>Досягнуто ліміт пошуків!</b>\n
Ти вже відстежуєш максимальну кількість посилань.\n
Щоб додати нове, видали щось із старого через меню /my_searches.
'''

NEW_SEARCHES = '''
✅ <b>Посилання прийнято!</b>\n
Я почав моніторинг цієї категорії. Щойно з'явиться нове оголошення — ти дізнаєшся про це миттєво. 🚀
'''